Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/renesas/ek_ra4m3/sftp_client_demo/keil/startup_ra4m3.S
; Reset handler
Reset_Handler    PROC
                 EXPORT  Reset_Handler             [WEAK]
        IMPORT  SystemInit
        IMPORT  __main

                 ; Set vector table offset
                 LDR     R0, =0xE000ED08
                 LDR     R1, =__Vectors
                 STR     R1, [R0]

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler          [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler          [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler           [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler           [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler             [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler            [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  ICU_IRQ0_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ1_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ2_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ3_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ4_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ5_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ6_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ7_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ8_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ9_IRQHandler               [WEAK]
                EXPORT  ICU_IRQ10_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ11_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ12_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ13_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ14_IRQHandler              [WEAK]
                EXPORT  ICU_IRQ15_IRQHandler              [WEAK]
                EXPORT  DMAC0_INT_IRQHandler              [WEAK]
                EXPORT  DMAC1_INT_IRQHandler              [WEAK]
                EXPORT  DMAC2_INT_IRQHandler              [WEAK]
                EXPORT  DMAC3_INT_IRQHandler              [WEAK]
                EXPORT  DMAC4_INT_IRQHandler              [WEAK]
                EXPORT  DMAC5_INT_IRQHandler              [WEAK]
                EXPORT  DMAC6_INT_IRQHandler              [WEAK]
                EXPORT  DMAC7_INT_IRQHandler              [WEAK]
                EXPORT  DTC_COMPLETE_IRQHandler           [WEAK]
                EXPORT  DMA_TRANSERR_IRQHandler           [WEAK]
                EXPORT  ICU_SNOOZE_CANCEL_IRQHandler      [WEAK]
                EXPORT  FCU_FIFERR_IRQHandler             [WEAK]
                EXPORT  FCU_FRDYI_IRQHandler              [WEAK]
                EXPORT  LVD_LVD1_IRQHandler               [WEAK]
                EXPORT  LVD_LVD2_IRQHandler               [WEAK]
                EXPORT  CGC_MOSC_STOP_IRQHandler          [WEAK]
                EXPORT  LPM_SNOOZE_REQUEST_IRQHandler     [WEAK]
                EXPORT  AGT0_INT_IRQHandler               [WEAK]
                EXPORT  AGT0_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT0_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT1_INT_IRQHandler               [WEAK]
                EXPORT  AGT1_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT1_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT2_INT_IRQHandler               [WEAK]
                EXPORT  AGT2_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT2_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT3_INT_IRQHandler               [WEAK]
                EXPORT  AGT3_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT3_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT4_INT_IRQHandler               [WEAK]
                EXPORT  AGT4_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT4_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  AGT5_INT_IRQHandler               [WEAK]
                EXPORT  AGT5_COMPARE_A_IRQHandler         [WEAK]
                EXPORT  AGT5_COMPARE_B_IRQHandler         [WEAK]
                EXPORT  IWDT_UNDERFLOW_IRQHandler         [WEAK]
                EXPORT  WDT_UNDERFLOW_IRQHandler          [WEAK]
                EXPORT  RTC_ALARM_IRQHandler              [WEAK]
                EXPORT  RTC_PERIOD_IRQHandler             [WEAK]
                EXPORT  RTC_CARRY_IRQHandler              [WEAK]
                EXPORT  USBFS_FIFO_0_IRQHandler           [WEAK]
                EXPORT  USBFS_FIFO_1_IRQHandler           [WEAK]
                EXPORT  USBFS_INT_IRQHandler              [WEAK]
                EXPORT  USBFS_RESUME_IRQHandler           [WEAK]
                EXPORT  IIC0_RXI_IRQHandler               [WEAK]
                EXPORT  IIC0_TXI_IRQHandler               [WEAK]
                EXPORT  IIC0_TEI_IRQHandler               [WEAK]
                EXPORT  IIC0_ERI_IRQHandler               [WEAK]
                EXPORT  IIC0_WUI_IRQHandler               [WEAK]
                EXPORT  IIC1_RXI_IRQHandler               [WEAK]
                EXPORT  IIC1_TXI_IRQHandler               [WEAK]
                EXPORT  IIC1_TEI_IRQHandler               [WEAK]
                EXPORT  IIC1_ERI_IRQHandler               [WEAK]
                EXPORT  SDHIMMC0_ACCS_IRQHandler          [WEAK]
                EXPORT  SDHIMMC0_SDIO_IRQHandler          [WEAK]
                EXPORT  SDHIMMC0_CARD_IRQHandler          [WEAK]
                EXPORT  SDHIMMC0_DMA_REQ_IRQHandler       [WEAK]
                EXPORT  SSI0_TXI_IRQHandler               [WEAK]
                EXPORT  SSI0_RXI_IRQHandler               [WEAK]
                EXPORT  SSI0_INT_IRQHandler               [WEAK]
                EXPORT  CTSU_WRITE_IRQHandler             [WEAK]
                EXPORT  CTSU_READ_IRQHandler              [WEAK]
                EXPORT  CTSU_END_IRQHandler               [WEAK]
                EXPORT  CAC_FREQUENCY_ERROR_IRQHandler    [WEAK]
                EXPORT  CAC_MEASUREMENT_END_IRQHandler    [WEAK]
                EXPORT  CAC_OVERFLOW_IRQHandler           [WEAK]
                EXPORT  CAN0_ERROR_IRQHandler             [WEAK]
                EXPORT  CAN0_FIFO_RX_IRQHandler           [WEAK]
                EXPORT  CAN0_FIFO_TX_IRQHandler           [WEAK]
                EXPORT  CAN0_MAILBOX_RX_IRQHandler        [WEAK]
                EXPORT  CAN0_MAILBOX_TX_IRQHandler        [WEAK]
                EXPORT  CAN1_ERROR_IRQHandler             [WEAK]
                EXPORT  CAN1_FIFO_RX_IRQHandler           [WEAK]
                EXPORT  CAN1_FIFO_TX_IRQHandler           [WEAK]
                EXPORT  CAN1_MAILBOX_RX_IRQHandler        [WEAK]
                EXPORT  CAN1_MAILBOX_TX_IRQHandler        [WEAK]
                EXPORT  IOPORT_EVENT_1_IRQHandler         [WEAK]
                EXPORT  IOPORT_EVENT_2_IRQHandler         [WEAK]
                EXPORT  IOPORT_EVENT_3_IRQHandler         [WEAK]
                EXPORT  IOPORT_EVENT_4_IRQHandler         [WEAK]
                EXPORT  ELC_SOFTWARE_EVENT_0_IRQHandler   [WEAK]
                EXPORT  ELC_SOFTWARE_EVENT_1_IRQHandler   [WEAK]
                EXPORT  POEG0_EVENT_IRQHandler            [WEAK]
                EXPORT  POEG1_EVENT_IRQHandler            [WEAK]
                EXPORT  POEG2_EVENT_IRQHandler            [WEAK]
                EXPORT  POEG3_EVENT_IRQHandler            [WEAK]
                EXPORT  GPT0_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT0_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT0_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT0_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT0_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT0_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT0_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT0_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT0_PC_IRQHandler                [WEAK]
                EXPORT  GPT1_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT1_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT1_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT1_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT1_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT1_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT1_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT1_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT1_PC_IRQHandler                [WEAK]
                EXPORT  GPT2_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT2_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT2_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT2_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT2_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT2_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT2_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT2_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT3_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT3_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT3_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT3_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT3_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT3_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT3_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT3_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT4_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT4_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT4_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT4_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT4_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT4_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT4_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT4_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT4_PC_IRQHandler                [WEAK]
                EXPORT  GPT5_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT5_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT5_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT5_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT5_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT5_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT5_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT5_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT5_PC_IRQHandler                [WEAK]
                EXPORT  GPT6_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT6_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT6_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT6_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT6_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT6_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT6_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT6_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  GPT6_PC_IRQHandler                [WEAK]
                EXPORT  GPT7_CAPTURE_COMPARE_A_IRQHandler [WEAK]
                EXPORT  GPT7_CAPTURE_COMPARE_B_IRQHandler [WEAK]
                EXPORT  GPT7_COMPARE_C_IRQHandler         [WEAK]
                EXPORT  GPT7_COMPARE_D_IRQHandler         [WEAK]
                EXPORT  GPT7_COMPARE_E_IRQHandler         [WEAK]
                EXPORT  GPT7_COMPARE_F_IRQHandler         [WEAK]
                EXPORT  GPT7_COUNTER_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  GPT7_COUNTER_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  OPS_UVW_EDGE_IRQHandler           [WEAK]
                EXPORT  ADC0_SCAN_END_IRQHandler          [WEAK]
                EXPORT  ADC0_SCAN_END_B_IRQHandler        [WEAK]
                EXPORT  ADC0_WINDOW_A_IRQHandler          [WEAK]
                EXPORT  ADC0_WINDOW_B_IRQHandler          [WEAK]
                EXPORT  ADC0_COMPARE_MATCH_IRQHandler     [WEAK]
                EXPORT  ADC0_COMPARE_MISMATCH_IRQHandler  [WEAK]
                EXPORT  ADC1_SCAN_END_IRQHandler          [WEAK]
                EXPORT  ADC1_SCAN_END_B_IRQHandler        [WEAK]
                EXPORT  ADC1_WINDOW_A_IRQHandler          [WEAK]
                EXPORT  ADC1_WINDOW_B_IRQHandler          [WEAK]
                EXPORT  ADC1_COMPARE_MATCH_IRQHandler     [WEAK]
                EXPORT  ADC1_COMPARE_MISMATCH_IRQHandler  [WEAK]
                EXPORT  SCI0_RXI_IRQHandler               [WEAK]
                EXPORT  SCI0_TXI_IRQHandler               [WEAK]
                EXPORT  SCI0_TEI_IRQHandler               [WEAK]
                EXPORT  SCI0_ERI_IRQHandler               [WEAK]
                EXPORT  SCI0_AM_IRQHandler                [WEAK]
                EXPORT  SCI0_RXI_OR_ERI_IRQHandler        [WEAK]
                EXPORT  SCI1_RXI_IRQHandler               [WEAK]
                EXPORT  SCI1_TXI_IRQHandler               [WEAK]
                EXPORT  SCI1_TEI_IRQHandler               [WEAK]
                EXPORT  SCI1_ERI_IRQHandler               [WEAK]
                EXPORT  SCI2_RXI_IRQHandler               [WEAK]
                EXPORT  SCI2_TXI_IRQHandler               [WEAK]
                EXPORT  SCI2_TEI_IRQHandler               [WEAK]
                EXPORT  SCI2_ERI_IRQHandler               [WEAK]
                EXPORT  SCI3_RXI_IRQHandler               [WEAK]
                EXPORT  SCI3_TXI_IRQHandler               [WEAK]
                EXPORT  SCI3_TEI_IRQHandler               [WEAK]
                EXPORT  SCI3_ERI_IRQHandler               [WEAK]
                EXPORT  SCI3_AM_IRQHandler                [WEAK]
                EXPORT  SCI4_RXI_IRQHandler               [WEAK]
                EXPORT  SCI4_TXI_IRQHandler               [WEAK]
                EXPORT  SCI4_TEI_IRQHandler               [WEAK]
                EXPORT  SCI4_ERI_IRQHandler               [WEAK]
                EXPORT  SCI4_AM_IRQHandler                [WEAK]
                EXPORT  SCI9_RXI_IRQHandler               [WEAK]
                EXPORT  SCI9_TXI_IRQHandler               [WEAK]
                EXPORT  SCI9_TEI_IRQHandler               [WEAK]
                EXPORT  SCI9_ERI_IRQHandler               [WEAK]
                EXPORT  SCI9_AM_IRQHandler                [WEAK]
                EXPORT  SCIX0_SCIX0_IRQHandler            [WEAK]
                EXPORT  SCIX0_SCIX1_IRQHandler            [WEAK]
                EXPORT  SCIX0_SCIX2_IRQHandler            [WEAK]
                EXPORT  SCIX0_SCIX3_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX0_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX1_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX2_IRQHandler            [WEAK]
                EXPORT  SCIX1_SCIX3_IRQHandler            [WEAK]
                EXPORT  SPI0_RXI_IRQHandler               [WEAK]
                EXPORT  SPI0_TXI_IRQHandler               [WEAK]
                EXPORT  SPI0_IDLE_IRQHandler              [WEAK]
                EXPORT  SPI0_ERI_IRQHandler               [WEAK]
                EXPORT  SPI0_TEI_IRQHandler               [WEAK]
                EXPORT  QSPI_INT_IRQHandler               [WEAK]
                EXPORT  DOC_INT_IRQHandler                [WEAK]

ICU_IRQ0_IRQHandler
ICU_IRQ1_IRQHandler
ICU_IRQ2_IRQHandler
ICU_IRQ3_IRQHandler
ICU_IRQ4_IRQHandler
ICU_IRQ5_IRQHandler
ICU_IRQ6_IRQHandler
ICU_IRQ7_IRQHandler
ICU_IRQ8_IRQHandler
ICU_IRQ9_IRQHandler
ICU_IRQ10_IRQHandler
ICU_IRQ11_IRQHandler
ICU_IRQ12_IRQHandler
ICU_IRQ13_IRQHandler
ICU_IRQ14_IRQHandler
ICU_IRQ15_IRQHandler
DMAC0_INT_IRQHandler
DMAC1_INT_IRQHandler
DMAC2_INT_IRQHandler
DMAC3_INT_IRQHandler
DMAC4_INT_IRQHandler
DMAC5_INT_IRQHandler
DMAC6_INT_IRQHandler
DMAC7_INT_IRQHandler
DTC_COMPLETE_IRQHandler
DMA_TRANSERR_IRQHandler
ICU_SNOOZE_CANCEL_IRQHandler
FCU_FIFERR_IRQHandler
FCU_FRDYI_IRQHandler
LVD_LVD1_IRQHandler
LVD_LVD2_IRQHandler
CGC_MOSC_STOP_IRQHandler
LPM_SNOOZE_REQUEST_IRQHandler
AGT0_INT_IRQHandler
AGT0_COMPARE_A_IRQHandler
AGT0_COMPARE_B_IRQHandler
AGT1_INT_IRQHandler
AGT1_COMPARE_A_IRQHandler
AGT1_COMPARE_B_IRQHandler
AGT2_INT_IRQHandler
AGT2_COMPARE_A_IRQHandler
AGT2_COMPARE_B_IRQHandler
AGT3_INT_IRQHandler
AGT3_COMPARE_A_IRQHandler
AGT3_COMPARE_B_IRQHandler
AGT4_INT_IRQHandler
AGT4_COMPARE_A_IRQHandler
AGT4_COMPARE_B_IRQHandler
AGT5_INT_IRQHandler
AGT5_COMPARE_A_IRQHandler
AGT5_COMPARE_B_IRQHandler
IWDT_UNDERFLOW_IRQHandler
WDT_UNDERFLOW_IRQHandler
RTC_ALARM_IRQHandler
RTC_PERIOD_IRQHandler
RTC_CARRY_IRQHandler
USBFS_FIFO_0_IRQHandler
USBFS_FIFO_1_IRQHandler
USBFS_INT_IRQHandler
USBFS_RESUME_IRQHandler
IIC0_RXI_IRQHandler
IIC0_TXI_IRQHandler
IIC0_TEI_IRQHandler
IIC0_ERI_IRQHandler
IIC0_WUI_IRQHandler
IIC1_RXI_IRQHandler
IIC1_TXI_IRQHandler
IIC1_TEI_IRQHandler
IIC1_ERI_IRQHandler
SDHIMMC0_ACCS_IRQHandler
SDHIMMC0_SDIO_IRQHandler
SDHIMMC0_CARD_IRQHandler
SDHIMMC0_DMA_REQ_IRQHandler
SSI0_TXI_IRQHandler
SSI0_RXI_IRQHandler
SSI0_INT_IRQHandler
CTSU_WRITE_IRQHandler
CTSU_READ_IRQHandler
CTSU_END_IRQHandler
CAC_FREQUENCY_ERROR_IRQHandler
CAC_MEASUREMENT_END_IRQHandler
CAC_OVERFLOW_IRQHandler
CAN0_ERROR_IRQHandler
CAN0_FIFO_RX_IRQHandler
CAN0_FIFO_TX_IRQHandler
CAN0_MAILBOX_RX_IRQHandler
CAN0_MAILBOX_TX_IRQHandler
CAN1_ERROR_IRQHandler
CAN1_FIFO_RX_IRQHandler
CAN1_FIFO_TX_IRQHandler
CAN1_MAILBOX_RX_IRQHandler
CAN1_MAILBOX_TX_IRQHandler
IOPORT_EVENT_1_IRQHandler
IOPORT_EVENT_2_IRQHandler
IOPORT_EVENT_3_IRQHandler
IOPORT_EVENT_4_IRQHandler
ELC_SOFTWARE_EVENT_0_IRQHandler
ELC_SOFTWARE_EVENT_1_IRQHandler
POEG0_EVENT_IRQHandler
POEG1_EVENT_IRQHandler
POEG2_EVENT_IRQHandler
POEG3_EVENT_IRQHandler
GPT0_CAPTURE_COMPARE_A_IRQHandler
GPT0_CAPTURE_COMPARE_B_IRQHandler
GPT0_COMPARE_C_IRQHandler
GPT0_COMPARE_D_IRQHandler
GPT0_COMPARE_E_IRQHandler
GPT0_COMPARE_F_IRQHandler
GPT0_COUNTER_OVERFLOW_IRQHandler
GPT0_COUNTER_UNDERFLOW_IRQHandler
GPT0_PC_IRQHandler
GPT1_CAPTURE_COMPARE_A_IRQHandler
GPT1_CAPTURE_COMPARE_B_IRQHandler
GPT1_COMPARE_C_IRQHandler
GPT1_COMPARE_D_IRQHandler
GPT1_COMPARE_E_IRQHandler
GPT1_COMPARE_F_IRQHandler
GPT1_COUNTER_OVERFLOW_IRQHandler
GPT1_COUNTER_UNDERFLOW_IRQHandler
GPT1_PC_IRQHandler
GPT2_CAPTURE_COMPARE_A_IRQHandler
GPT2_CAPTURE_COMPARE_B_IRQHandler
GPT2_COMPARE_C_IRQHandler
GPT2_COMPARE_D_IRQHandler
GPT2_COMPARE_E_IRQHandler
GPT2_COMPARE_F_IRQHandler
GPT2_COUNTER_OVERFLOW_IRQHandler
GPT2_COUNTER_UNDERFLOW_IRQHandler
GPT3_CAPTURE_COMPARE_A_IRQHandler
GPT3_CAPTURE_COMPARE_B_IRQHandler
GPT3_COMPARE_C_IRQHandler
GPT3_COMPARE_D_IRQHandler
GPT3_COMPARE_E_IRQHandler
GPT3_COMPARE_F_IRQHandler
GPT3_COUNTER_OVERFLOW_IRQHandler
GPT3_COUNTER_UNDERFLOW_IRQHandler
GPT4_CAPTURE_COMPARE_A_IRQHandler
GPT4_CAPTURE_COMPARE_B_IRQHandler
GPT4_COMPARE_C_IRQHandler
GPT4_COMPARE_D_IRQHandler
GPT4_COMPARE_E_IRQHandler
GPT4_COMPARE_F_IRQHandler
GPT4_COUNTER_OVERFLOW_IRQHandler
GPT4_COUNTER_UNDERFLOW_IRQHandler
GPT4_PC_IRQHandler
GPT5_CAPTURE_COMPARE_A_IRQHandler
GPT5_CAPTURE_COMPARE_B_IRQHandler
GPT5_COMPARE_C_IRQHandler
GPT5_COMPARE_D_IRQHandler
GPT5_COMPARE_E_IRQHandler
GPT5_COMPARE_F_IRQHandler
GPT5_COUNTER_OVERFLOW_IRQHandler
GPT5_COUNTER_UNDERFLOW_IRQHandler
GPT5_PC_IRQHandler
GPT6_CAPTURE_COMPARE_A_IRQHandler
GPT6_CAPTURE_COMPARE_B_IRQHandler
GPT6_COMPARE_C_IRQHandler
GPT6_COMPARE_D_IRQHandler
GPT6_COMPARE_E_IRQHandler
GPT6_COMPARE_F_IRQHandler
GPT6_COUNTER_OVERFLOW_IRQHandler
GPT6_COUNTER_UNDERFLOW_IRQHandler
GPT6_PC_IRQHandler
GPT7_CAPTURE_COMPARE_A_IRQHandler
GPT7_CAPTURE_COMPARE_B_IRQHandler
GPT7_COMPARE_C_IRQHandler
GPT7_COMPARE_D_IRQHandler
GPT7_COMPARE_E_IRQHandler
GPT7_COMPARE_F_IRQHandler
GPT7_COUNTER_OVERFLOW_IRQHandler
GPT7_COUNTER_UNDERFLOW_IRQHandler
OPS_UVW_EDGE_IRQHandler
ADC0_SCAN_END_IRQHandler
ADC0_SCAN_END_B_IRQHandler
ADC0_WINDOW_A_IRQHandler
ADC0_WINDOW_B_IRQHandler
ADC0_COMPARE_MATCH_IRQHandler
ADC0_COMPARE_MISMATCH_IRQHandler
ADC1_SCAN_END_IRQHandler
ADC1_SCAN_END_B_IRQHandler
ADC1_WINDOW_A_IRQHandler
ADC1_WINDOW_B_IRQHandler
ADC1_COMPARE_MATCH_IRQHandler
ADC1_COMPARE_MISMATCH_IRQHandler
SCI0_RXI_IRQHandler
SCI0_TXI_IRQHandler
SCI0_TEI_IRQHandler
SCI0_ERI_IRQHandler
SCI0_AM_IRQHandler
SCI0_RXI_OR_ERI_IRQHandler
SCI1_RXI_IRQHandler
SCI1_TXI_IRQHandler
SCI1_TEI_IRQHandler
SCI1_ERI_IRQHandler
SCI2_RXI_IRQHandler
SCI2_TXI_IRQHandler
SCI2_TEI_IRQHandler
SCI2_ERI_IRQHandler
SCI3_RXI_IRQHandler
SCI3_TXI_IRQHandler
SCI3_TEI_IRQHandler
SCI3_ERI_IRQHandler
SCI3_AM_IRQHandler
SCI4_RXI_IRQHandler
SCI4_TXI_IRQHandler
SCI4_TEI_IRQHandler
SCI4_ERI_IRQHandler
SCI4_AM_IRQHandler
SCI9_RXI_IRQHandler
SCI9_TXI_IRQHandler
SCI9_TEI_IRQHandler
SCI9_ERI_IRQHandler
SCI9_AM_IRQHandler
SCIX0_SCIX0_IRQHandler
SCIX0_SCIX1_IRQHandler
SCIX0_SCIX2_IRQHandler
SCIX0_SCIX3_IRQHandler
SCIX1_SCIX0_IRQHandler
SCIX1_SCIX1_IRQHandler
SCIX1_SCIX2_IRQHandler
SCIX1_SCIX3_IRQHandler
SPI0_RXI_IRQHandler
SPI0_TXI_IRQHandler
SPI0_IDLE_IRQHandler
SPI0_ERI_IRQHandler
SPI0_TEI_IRQHandler
QSPI_INT_IRQHandler
DOC_INT_IRQHandler
                B       .

                ENDP

                ALIGN

;*******************************************************************************
; User Stack and Heap initialization
;*******************************************************************************
;                 IF      :DEF:__MICROLIB

;                 EXPORT  __initial_sp
;                 EXPORT  __heap_base
;                 EXPORT  __heap_limit

;                 ELSE

;                 IMPORT  __use_two_region_memory
;                 EXPORT  __user_initial_stackheap

;__user_initial_stackheap

;                 LDR     R0, =  Heap_Mem
;                 LDR     R1, =(Stack_Mem + Stack_Size)
;                 LDR     R2, = (Heap_Mem +  Heap_Size)
;                 LDR     R3, = Stack_Mem
;                 BX      LR

;                 ALIGN

;                 ENDIF

                 END
